package com.example.administrator.testlighting

object Data{
    val map = mapOf(
        "夜间在没有路灯，照明条件不良的情况下行驶" to "开远光灯",
        "同方向近距离跟车行驶" to "近光灯",
        "超车" to "远近光交替",
        "与对方会车距对方将近150米" to "近光灯",
        "夜间在窄路窄桥与非机动车会车" to "近光灯",
        "夜间通过急弯、坡路、拱桥、人行道、或没有交通信息灯路口" to "远近光交替",
        "夜间在有路灯照明良好的条件下行驶" to "近光灯",
        "通过路口" to "远近光交替",
        "路边临时停车" to "开示廓灯，关闭远近光灯"
    )

    val map2 = mapOf(
        "近光灯" to "0",
        "开远光灯" to "1",
        "远近光交替" to "1010",
        "开示廓灯，关闭远近光灯" to "-1"
    )
}